app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params) #whitelisting of title and description
    @article.user = User.first
    if @article.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "adaadadadsdaadaadadadsda"], ["description", "adaadadadsdaadaadadadsda"], ["created_at", "2021-02-10 17:07:22.373977"], ["updated_at", "2021-02-10 17:07:22.373977"], ["user_id", 2]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "edited - description of the first article"], ["updated_at", "2021-02-06 21:11:05.654796"], ["id", 1]]