app/controllers/users_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]
---
  def show
    @articles = @user.articles.paginate(page: params[:page], per_page: 5)

SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page], per_page: 5)

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$JSorrnTUYHM94nC1YjhhD.j7DK.sGyb7COE5vNcXEPRIdUcpASGsy"], ["updated_at", "2021-02-12 16:13:45.347241"], ["id", 2]]
---
  def update
    if @user.update(user_params)